<img style="float: left; margin: 30px 15px 15px 15px;" src="https://pngimage.net/wp-content/uploads/2018/06/logo-iteso-png-5.png" width="300" height="500" /> 
    
    
### <font color='navy'> Finanzas Cuantitativas. 

**Nombres:** Jesús Álvarez, Ariadna Galindo, Romina Gutierrez y Rodolfo Slay.

**Fecha:** 24 de octubre del 2020.

**Expediente** : 714552, 718272, 718415 y 715214.

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("Data_OilCompany.csv")

In [3]:
inv = -500000

In [4]:
data.head()

       Year 1        Year 2        Year 3        Year 4        Year 5
0   203,726.00    279,969.00    465,303.00    200,445.00     96,319.00
1   263,845.00    272,439.00      2,192.00    199,901.00          -
2    27,726.00    334,861.00     82,265.00    199,954.00     64,958.00
3   293,801.00    210,117.00    275,087.00    199,934.00          -
4   297,319.00    242,569.00    464,097.00    200,598.00    141,285.00

In [5]:
def replace_text(x,to_replace,replacement):
    try:
        x= x.replace(to_replace,replacement)
    except:
        pass
    return x

In [6]:
for i in range(len(data.columns)): 
    data.iloc[:,i] = data.iloc[:,i].apply(replace_text,args=(',',''))

In [7]:
for i in range(len(data.columns)): 
    data.iloc[:,i] = data.iloc[:,i].apply(replace_text,args=('.00',''))

In [8]:
for i in range(len(data.columns)): 
    data.iloc[:,i] = data.iloc[:,i].apply(replace_text,args=('-','0'))

In [9]:
data.head()

    Year 1     Year 2     Year 3     Year 4     Year 5
0    203726     279969     465303     200445      96319
1    263845     272439       2192     199901       0
2     27726     334861      82265     199954      64958
3    293801     210117     275087     199934       0
4    297319     242569     464097     200598     141285

In [10]:
for i in range(len(data.columns)): 
    data.iloc[:,i] = data.iloc[:,i].astype(int)

In [11]:
def IRR(row,invest):
    i = [invest]
    v = list(row) #Inversion en Negativo
    ans = i + v
    return np.irr(ans)

In [12]:
Respuestas = pd.DataFrame(data = {'IRR':np.ones(len(data)),
                                 'NPV':np.ones(len(data))})

In [13]:
for i in range(len(data)):
    Respuestas.iloc[i,0] = IRR(data.iloc[i,:], inv)

In [14]:
Respuestas.head()

        IRR  NPV
0  0.433128  1.0
1  0.208285  1.0
2  0.131378  1.0
3  0.356542  1.0
4  0.502458  1.0

In [15]:
r = 0.03
for i in range(len(data)):
    Respuestas.iloc[i,1] = np.npv(r,[inv] + list(data.iloc[i,:]))

In [16]:
Respuestas.head()

        IRR            NPV
0  0.433128  648686.428439
1  0.208285  192575.520946
2  0.131378  151531.064532
3  0.356542  412681.457044
4  0.502458  742120.676004

In [17]:
print('La probabilidad de que los datos superen a la tasa libre de riesgo es de: ', (np.sum(Respuestas['IRR'] > r)) / len(Respuestas))

La probabilidad de que los datos superen a la tasa libre de riesgo es de:  0.9795

In [18]:
print('La probabilidad de que la IRR supere el 35% es de: ', (np.sum(Respuestas['IRR'] > .35)) / len(Respuestas))

La probabilidad de que la IRR supere el 35% es de:  0.3585

In [19]:
print('La probabilidad de que los el valor supere los 2M es de: ', (np.sum(Respuestas['NPV'] > 2000000)) / len(Respuestas))

La probabilidad de que los el valor supere los 2M es de:  0.0

In [20]:
print('La probabilidad de que el IRR se encuentre entre 10 y 20% es de: ', (np.sum((Respuestas['IRR'] > .10) & (Respuestas['IRR'] < .20)) / len(Respuestas)))

La probabilidad de que el IRR se encuentre entre 10 y 20% es de:  0.1655